hatena/enq.org
#+setupfile: ../org/info/index-bigblow-header.setup
#+include: ../org/info/common-header.org
#+AUTHOR: 鈴木正幸，非常勤講師
#+Title: 生物統計学 アンケート
#+OPTIONS: tex:t 
#+property: header-args:R :session *biot* :results output :exports both

* 10/28 3回目
** 理解したこと、印象に残ったこと
- 四則演算について
- Rの使い方
- 行列を考える際や、データの個数や平均、標準偏差や標準分散などが素早く正確に知ることができて便利だと感じました。
- 前回に続いて統計の基礎を学んだ
- Rの行列の使い方を学んだ
- 先に入門統計学を読んでから授業に参加したので分散、標準偏差等理解しやすかったです。
- data.frameとlistの違いについて理解できた。
- 今日の講義では複数のデータをグラフ化した。データを一見しただけでは分からない特徴が形となって現れるため、モデル構築する際の参考になると思った。
- Ｒを使うことで、表のデータを解析したり、グラフにまとめられることがわかった。
- 簡単な行列の作成と演算、箱ひげ図のプロットの仕方
- 行列
- グラフなどもRでできてしまうこと

** 理解できなかったこと
- 最後のスライドについて
- 統計学の最終的な使い方わからない
- 物理を今まで取っていなかったので、分散の例えの説明がよく理解できませんでした。
- 関数や言葉の意味が分からないまま進むことがあったので、少し難しく感じ
  た。どの関数がどういうことができるのか、というのは覚えなければ使いこ
  なせないため早く覚えなければと思った。
- ヒストグラムが開けなかったので、RStudioでないとだめなのかわからなかっ
  た。
- array（ベクトル、各次元の要素の個数）が何を意味するのかよく分からな
  かった
- 先生がどのスライドをひらいているかたまにわからない
- Excel等のデータ情報をRで読み取ること

** 質問・要望・意見をお願いします．
   
- 授業の進行速度はちょうど良い。タイピングに自信がないが集中して取り組
  めばついて行けるので、このままで大丈夫だと思う。
- 出席しました
- Ｒの使い方や統計学の基礎知識などを説明してただいていますが、いまいち
  生物統計学がどのようなものなのかまだ理解できていない気がします。
- 物理の例えはわかり辛かったので他の例えをお願いします。
- 今後実施する予定でしたら申し訳ないのですが、Rのプログラムによる図表
  のプロットにも今後の講義で触れて欲しいです。
- 用語の説明が欲しいと思った。確率密度関数の説明があったが、計算式の説
  明の前にその目的や言葉の説明があるととっかかりやすいように感じた。と
  はいえ、その都度調べれば対応可能なので、調べる時間が確保できれば良い
  ようにも思った。
- 講義最後の大豆データに関するもので、Rでダイズデータを読み込むことが
  できなかったので、次回冒頭でもう一度説明していただけるとありがたいで
  す。
- 最初はプログラミング、その後は、統計の授業のように進行を分けても良い
  かもしれません







































































































  
  












































































































































































































  
* 10/14 2回目

** 理解したこと、印象に残ったこと
   - ここまで関数を丁寧に解説してもらえる授業は他になかったためとても分かりやすかった。
   - 特にwhich関数の使い方が参考になった。which()[]で抽出したデータの中から要素を取り出すことができると知り、便利だと思った。Rの関数は無数にあるため、分かりやすい解説とともに教えてもらえて良かった。
   - Rを使う中であまり細かいところは意識して使ってこなかったので、細かい部分の確認ができて良かったです。
   - 基本的な代入の仕方
   - Rの使い方、Rの便利さ
   - 始めは何も分からず入力していたコマンドで回答が瞬時に帰ってくることが非常に印象に残ったし楽しかった。
   - Rを利用した計算方法や、Rの機能島について理解できた。
   - Rの使い方、演算方法
   - Rの簡単な演算について
   - Rの開き方使い方
   - ベクトルの表現
   - スライドの内容をRに移しながら使い方やRで出来ることを理解することが出来た
   - プログラミングっぽいことに初めて触れたので、関数を入力すると結果が出ることにとても感動した。前期の確率統計学ではこのような内容は学習しなかったので理解が難しい部分が多いが、資料を見たり自宅でRを使ってみたりして理解を進めていきたいと思う。
   - Rを用いた数値やベクトルの処理の仕方の基礎について理解することが出来ました。掲示されている資料を家でも見返して復習したいと思います。
   - Rにおける基本操作（計算など）
   - Rの操作の基本がわかった
   - Rコマンダーをこのように扱ったことがなかったので、はじめ理解するのに時間がかかったが後半に進むにつれてRコマンダーを使えるようになってきたと感じる。
   - 今後生物統計学で何を学ぶか
   - Rを使うことの便利さが分かりました
   - Rの基本的な使い方や簡単な計算のやり方について
   - アールの扱いについて
   - Rを利用した簡単な演算を理解することができた
   - Rの基礎
   - Ｒの初歩的な使い方、例えば四則演算の仕方や入力したデータが表す意味などを学び、その中で記号の意味などをルールを理解して覚えていくのが大切なのだと感じました。
   - ( )  や［］などを使うことで、何を表すかが変わることがわかった。


** 理解できなかったこと
- 板書
- Rでエラーが出るタイミング
- たまに現れるエラーや、使用するコマンドを覚えなければいけないのかという不安がある。
- スライドの資料のこと
- パワポへの書き込みのいいやり方
- 文字においてから、文字を用いて複数の要素を取り出すことができませんでした。自分なりに頑張ってみます。
- まだ、スライドを見ずに自分で考えながらRを使うことやベクトルのちゃんとした理解が追いつくことが出来なかったと感じた
- 今回の授業については特にありません。
- 今の所は特にないです。
- 最後の方の表
- first,second,などと名前を付ける手法があったが、名前を付けられる、というだけで名前をつけなくとも扱いたい数値の順番を打ち込めばいいのではないかと感じました。今後名前を付けることの利点が出てくるのでしょうか？
- パワポに書き込む方法
- （）と［］の使い分けがよく理解できていない
- 今回出ててきたベクトル表示の意味

  
** 質問・要望・意見をお願いします．
- ベイズ統計を勉強したいのですが、今後の授業で触れる機会はあるのでしょうか。
- Rに関してなのですが、基礎的な項目ということもあり、躓く人も少なそう
  なのでもう少し授業のペースが早くてもいいように感じました。
- もう少しペースが速くても大丈夫です。最後の度数のところは、先生のスラ
  イドの矢印が８の度数のところからずれていただけだと思います。
- もう少しだけ板書の字を大きくしてくだされば助かります。
- 期末試験などの詳細が決まり次第連絡をいただけると助かる。また、今はま
  だ簡単な関数も手間取っているが、慣れてきたら実際にどのように使用され
  ているのかという使用例なども見てみたいと思った。
- 使っていくのは楽しかったのでもっと内容を多くやりたい
- 後半のスライドの重要性があまり理解できなかった
- 次回からは今資料のどの部分を話しているのかもう少し明確にしてくださると、授業についていきやすいと思います。
- これ以降も頑張ります
- こまめにみんなの進捗状況を確かめながら進めていけば良いと思う。また、Rの扱う内容にもよるが、Rと統計の内容を半分ずつにしても良いと思う。
- 今回学んだことやこれから説明していただくRの使い方を理解して統計学をより深く知ることができるように準備したいと思いました。
- もう少し進度を早めて欲しい
