hatena/enq.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-03 水 21:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>生物統計学 アンケート</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">生物統計学 アンケート</h1>

<div id="outline-container-org5764e6d" class="outline-2">
<h2 id="org5764e6d">10/28 3回目</h2>
<div class="outline-text-2" id="text-org5764e6d">
</div>
<div id="outline-container-org49ad760" class="outline-3">
<h3 id="org49ad760">理解したこと、印象に残ったこと</h3>
<div class="outline-text-3" id="text-org49ad760">
<ul class="org-ul">
<li>四則演算について</li>
<li>Rの使い方</li>
<li>行列を考える際や、データの個数や平均、標準偏差や標準分散などが素早く正確に知ることができて便利だと感じました。</li>
<li>前回に続いて統計の基礎を学んだ</li>
<li>Rの行列の使い方を学んだ</li>
<li>先に入門統計学を読んでから授業に参加したので分散、標準偏差等理解しやすかったです。</li>
<li>data.frameとlistの違いについて理解できた。</li>
<li>今日の講義では複数のデータをグラフ化した。データを一見しただけでは分からない特徴が形となって現れるため、モデル構築する際の参考になると思った。</li>
<li>Ｒを使うことで、表のデータを解析したり、グラフにまとめられることがわかった。</li>
<li>簡単な行列の作成と演算、箱ひげ図のプロットの仕方</li>
<li>行列</li>
<li>グラフなどもRでできてしまうこと</li>
</ul>
</div>
</div>

<div id="outline-container-org152da44" class="outline-3">
<h3 id="org152da44">理解できなかったこと</h3>
<div class="outline-text-3" id="text-org152da44">
<ul class="org-ul">
<li>最後のスライドについて</li>
<li>統計学の最終的な使い方わからない</li>
<li>物理を今まで取っていなかったので、分散の例えの説明がよく理解できませんでした。</li>
<li>関数や言葉の意味が分からないまま進むことがあったので、少し難しく感じ
た。どの関数がどういうことができるのか、というのは覚えなければ使いこ
なせないため早く覚えなければと思った。</li>
<li>ヒストグラムが開けなかったので、RStudioでないとだめなのかわからなかっ
た。</li>
<li>array（ベクトル、各次元の要素の個数）が何を意味するのかよく分からな
かった</li>
<li>先生がどのスライドをひらいているかたまにわからない</li>
<li>Excel等のデータ情報をRで読み取ること</li>
</ul>
</div>
</div>

<div id="outline-container-orge7427f8" class="outline-3">
<h3 id="orge7427f8">質問・要望・意見をお願いします．</h3>
<div class="outline-text-3" id="text-orge7427f8">
<ul class="org-ul">
<li>授業の進行速度はちょうど良い。タイピングに自信がないが集中して取り組
めばついて行けるので、このままで大丈夫だと思う。</li>
<li>出席しました</li>
<li>Ｒの使い方や統計学の基礎知識などを説明してただいていますが、いまいち
生物統計学がどのようなものなのかまだ理解できていない気がします。</li>
<li>物理の例えはわかり辛かったので他の例えをお願いします。</li>
<li>今後実施する予定でしたら申し訳ないのですが、Rのプログラムによる図表
のプロットにも今後の講義で触れて欲しいです。</li>
<li>用語の説明が欲しいと思った。確率密度関数の説明があったが、計算式の説
明の前にその目的や言葉の説明があるととっかかりやすいように感じた。と
はいえ、その都度調べれば対応可能なので、調べる時間が確保できれば良い
ようにも思った。</li>
<li>講義最後の大豆データに関するもので、Rでダイズデータを読み込むことが
できなかったので、次回冒頭でもう一度説明していただけるとありがたいで
す。</li>
<li>最初はプログラミング、その後は、統計の授業のように進行を分けても良い
かもしれません</li>
</ul>
</div>
</div>
</div>






















































































































































































































































































































<div id="outline-container-orgb2d68fd" class="outline-2">
<h2 id="orgb2d68fd">10/14 2回目</h2>
<div class="outline-text-2" id="text-orgb2d68fd">
</div>
<div id="outline-container-orgc197bc6" class="outline-3">
<h3 id="orgc197bc6">理解したこと、印象に残ったこと</h3>
<div class="outline-text-3" id="text-orgc197bc6">
<ul class="org-ul">
<li>ここまで関数を丁寧に解説してもらえる授業は他になかったためとても分かりやすかった。</li>
<li>特にwhich関数の使い方が参考になった。which()[]で抽出したデータの中から要素を取り出すことができると知り、便利だと思った。Rの関数は無数にあるため、分かりやすい解説とともに教えてもらえて良かった。</li>
<li>Rを使う中であまり細かいところは意識して使ってこなかったので、細かい部分の確認ができて良かったです。</li>
<li>基本的な代入の仕方</li>
<li>Rの使い方、Rの便利さ</li>
<li>始めは何も分からず入力していたコマンドで回答が瞬時に帰ってくることが非常に印象に残ったし楽しかった。</li>
<li>Rを利用した計算方法や、Rの機能島について理解できた。</li>
<li>Rの使い方、演算方法</li>
<li>Rの簡単な演算について</li>
<li>Rの開き方使い方</li>
<li>ベクトルの表現</li>
<li>スライドの内容をRに移しながら使い方やRで出来ることを理解することが出来た</li>
<li>プログラミングっぽいことに初めて触れたので、関数を入力すると結果が出ることにとても感動した。前期の確率統計学ではこのような内容は学習しなかったので理解が難しい部分が多いが、資料を見たり自宅でRを使ってみたりして理解を進めていきたいと思う。</li>
<li>Rを用いた数値やベクトルの処理の仕方の基礎について理解することが出来ました。掲示されている資料を家でも見返して復習したいと思います。</li>
<li>Rにおける基本操作（計算など）</li>
<li>Rの操作の基本がわかった</li>
<li>Rコマンダーをこのように扱ったことがなかったので、はじめ理解するのに時間がかかったが後半に進むにつれてRコマンダーを使えるようになってきたと感じる。</li>
<li>今後生物統計学で何を学ぶか</li>
<li>Rを使うことの便利さが分かりました</li>
<li>Rの基本的な使い方や簡単な計算のやり方について</li>
<li>アールの扱いについて</li>
<li>Rを利用した簡単な演算を理解することができた</li>
<li>Rの基礎</li>
<li>Ｒの初歩的な使い方、例えば四則演算の仕方や入力したデータが表す意味などを学び、その中で記号の意味などをルールを理解して覚えていくのが大切なのだと感じました。</li>
<li>( )  や［］などを使うことで、何を表すかが変わることがわかった。</li>
</ul>
</div>
</div>


<div id="outline-container-org3ce09bf" class="outline-3">
<h3 id="org3ce09bf">理解できなかったこと</h3>
<div class="outline-text-3" id="text-org3ce09bf">
<ul class="org-ul">
<li>板書</li>
<li>Rでエラーが出るタイミング</li>
<li>たまに現れるエラーや、使用するコマンドを覚えなければいけないのかという不安がある。</li>
<li>スライドの資料のこと</li>
<li>パワポへの書き込みのいいやり方</li>
<li>文字においてから、文字を用いて複数の要素を取り出すことができませんでした。自分なりに頑張ってみます。</li>
<li>まだ、スライドを見ずに自分で考えながらRを使うことやベクトルのちゃんとした理解が追いつくことが出来なかったと感じた</li>
<li>今回の授業については特にありません。</li>
<li>今の所は特にないです。</li>
<li>最後の方の表</li>
<li>first,second,などと名前を付ける手法があったが、名前を付けられる、というだけで名前をつけなくとも扱いたい数値の順番を打ち込めばいいのではないかと感じました。今後名前を付けることの利点が出てくるのでしょうか？</li>
<li>パワポに書き込む方法</li>
<li>（）と［］の使い分けがよく理解できていない</li>
<li>今回出ててきたベクトル表示の意味</li>
</ul>
</div>
</div>


<div id="outline-container-orgd6d404e" class="outline-3">
<h3 id="orgd6d404e">質問・要望・意見をお願いします．</h3>
<div class="outline-text-3" id="text-orgd6d404e">
<ul class="org-ul">
<li>ベイズ統計を勉強したいのですが、今後の授業で触れる機会はあるのでしょうか。</li>
<li>Rに関してなのですが、基礎的な項目ということもあり、躓く人も少なそう
なのでもう少し授業のペースが早くてもいいように感じました。</li>
<li>もう少しペースが速くても大丈夫です。最後の度数のところは、先生のスラ
イドの矢印が８の度数のところからずれていただけだと思います。</li>
<li>もう少しだけ板書の字を大きくしてくだされば助かります。</li>
<li>期末試験などの詳細が決まり次第連絡をいただけると助かる。また、今はま
だ簡単な関数も手間取っているが、慣れてきたら実際にどのように使用され
ているのかという使用例なども見てみたいと思った。</li>
<li>使っていくのは楽しかったのでもっと内容を多くやりたい</li>
<li>後半のスライドの重要性があまり理解できなかった</li>
<li>次回からは今資料のどの部分を話しているのかもう少し明確にしてくださると、授業についていきやすいと思います。</li>
<li>これ以降も頑張ります</li>
<li>こまめにみんなの進捗状況を確かめながら進めていけば良いと思う。また、Rの扱う内容にもよるが、Rと統計の内容を半分ずつにしても良いと思う。</li>
<li>今回学んだことやこれから説明していただくRの使い方を理解して統計学をより深く知ることができるように準備したいと思いました。</li>
<li>もう少し進度を早めて欲しい</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師</p>
<p class="date">Created: 2021-11-03 水 21:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
